In [ ]:
#Question-1: How to import pandas and check the version.
import pandas as pd
print(pd.__version__)

1.1.4

In [ ]:
#Question-2: How to create a series from a numpy array.
import numpy as np
import pandas as pd
data=np.array(['jammukashmir','usa','singapore','korea','switzerland'])
series=pd.Series(data)
print(series)

0    jammukashmir
1             usa
2       singapore
3           korea
4     switzerland
dtype: object

In [ ]:
#Question-3: How to convert the index of a series into a column of a dataframe.
series=pd.Series(data,index=['a','b','c','d','e'])
print(series)
print()
df=series.to_frame().reset_index()
df.columns=["options","Names"]
df

a    jammukashmir
b             usa
c       singapore
d           korea
e     switzerland
dtype: object

  options         Names
0       a  jammukashmir
1       b           usa
2       c     singapore
3       d         korea
4       e   switzerland

In [ ]:
#Question-4: Write the code to list all the datasets available in seaborn libraray.
import seaborn as sns
mpg=sns.load_dataset('mpg')
print(mpg)

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
393  27.0          4  ...     usa            ford mustang gl
394  44.0          4  ...  europe                  vw pickup
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[398 rows x 9 columns]

In [ ]:
#Question-5: Which country origin cars are a part of this dataset.
import seaborn as sns
import pandas as pd
mpg=sns.load_dataset('mpg')
df=pd.DataFrame(mpg)
df.origin.unique()

array(['usa', 'japan', 'europe'], dtype=object)

In [ ]:
#Question-6: Extract the part of the dataframe which contains cars belonging to 'usa'.
import seaborn as sns
import pandas as pd
mpg=sns.load_dataset('mpg')
df=pd.DataFrame(mpg)
df[df['origin'].str.contains("usa")]

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
392  27.0          4  ...     usa           chevrolet camaro
393  27.0          4  ...     usa            ford mustang gl
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[249 rows x 9 columns]